Table of Contents
 Enum WeldingTypeSNIP
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Welding Type
public enum WeldingTypeSNIP
Fields
Automatic = 3
Automatic welding
AutomaticAndMachine = 2
Automatic and machine welding
Manual = 0
Manual welding
ManualSmallRodDiam = 1
Manual welding using rod solid cross-section with diameter less than 1.4mm
Fields
 Name |  Description
 Automatic = 3
Automatic welding
 AutomaticAndMachine = 2
Automatic and machine welding
 Manual = 0
Manual welding
 ManualSmallRodDiam = 1
Manual welding using rod solid cross-section with diameter less than 1.4mm
 Edit this page